Repository: SaifMusyanto/simple-bloc-brick
Catalog: lib/nedo_core/__brick__/lib/core/l10n/app_*.arb
Languages: id

# errorCannotNull
source: cannot null
id: tidak boleh kosong

# errorMustBeFilled
source: must be filled
id: wajib diisi

# errorConnectTimeout
source: connect timeout
id: waktu koneksi habis

# errorPleaseTryAgain
source: please try again
id: silakan coba lagi

# errorLangNotFound
source: language not found
id: bahasa tidak ditemukan

# errorNoData
source: no data can be show
id: tidak ada data untuk ditampilkan

# errorNullResponse
source: Server returned no data
id: Server tidak memberikan respon

# errorPleaseSelectImageFirst
source: please select image first
id: silakan pilih gambar terlebih dahulu

# errorReceiveTimeout
source: receive timeout
id: waktu menerima habis

# errorRequestCanceled
source: request canceled
id: permintaan dibatalkan

# errorRequestToServer
source: request connection failed
id: gagal terhubung ke server

# errorSendTimeout
source: send timeout
id: waktu mengirim habis

# textChangePassword
source: change password
id: ubah kata sandi

# textChangeRole
source: change role
id: ubah role

# textLogin
source: login
id: masuk

# textLogout
source: logout
id: keluar

# textSelectRole
source: select role
id: pilih role

# textPleaseLoginToContinue
source: please login to continue
id: silakan masuk untuk melanjutkan

# errorWrongEmailFormat
source: wrong email format
id: format email salah

# errorWrongNumberFormat
source: wrong number format
id: format angka salah

# textCharacter
source: character
id: karakter

# textLowerThan
source: lower than
id: kurang dari

# textMoreThan
source: more than
id: lebih dari

# errorPleaseSelectFileFirst
source: please select file first
id: silakan pilih berkas terlebih dahulu

# successDataDeleted
source: data successfully deleted
id: data berhasil dihapus

# successDataUpdated
source: data successfully updated
id: data berhasil diperbarui

# successDataInserted
source: data successfully inserted
id: data berhasil disisipkan

# errorBadRequest
source: Invalid request, please check your input.
id: Permintaan tidak valid, mohon periksa input Anda.

# errorUnauthorized
source: Your session has expired, please login again.
id: Sesi Anda telah berakhir, silakan login kembali.

# errorForbidden
source: You do not have access to this feature.
id: Anda tidak memiliki akses untuk fitur ini.

# errorNotFound
source: The data you are looking for was not found.
id: Data yang Anda cari tidak ditemukan.

# errorValidation
source: Some fields are invalid, please check your input.
id: Beberapa data tidak valid, silakan periksa kembali input Anda.

# errorTooManyRequests
source: Too many requests, please wait a moment.
id: Terlalu banyak permintaan, mohon tunggu sebentar.

# errorInternalServer
source: A system error occurred, please try again later.
id: Terjadi kesalahan pada sistem, silakan coba beberapa saat lagi.

# errorBadGateway
source: System is busy, please try again later.
id: Sistem sedang sibuk, silakan coba lagi nanti.

# errorMaintenance
source: Service is under maintenance.
id: Layanan sedang dalam perbaikan.

# errorGatewayTimeout
source: Server connection timed out, please try again.
id: Waktu tunggu server habis, silakan coba lagi.

# errorUnknown
source: An unknown error occurred.
id: Terjadi kesalahan yang tidak diketahui.
